;;TODO
;; 優先順位の高そうな物は☆をつける？

;;byte-compile-file自動化
;;init.el整理
;;load-pathの整理。再帰的にディレクトリを指定できた？
;; gitで管理
;;auto-installのインストール先を変更する。init.elからはできない？
;; Ruby on Rails用の変換予測が必要かも
;; "とか入力したら、自動的に文字を閉じてくれる機能が欲しい。
;; 日本語入力機能の検討。ddskkを使いこなす。
;; emacsからシェルを使いたい。いちいちプロンプトの画面を出すのが面倒。
;; 同様にgitも使いたい。
;; eclipseのように上部にタブを開きたい。それかバッファの移動をもっと楽にしたい。いらないかな。
;; Rubyでprivate以降はインデントするようにできないか？
;; 毎回立ち上げる旅にファイルを開くのが面倒。立ち上げっぱなしにする？
;; タブをスペースに出来ないか。
;; 関数のジャンプを出来るようにする。
;; フォルダの階層が使いづらい。文字を入力して、それにあてはまる候補の中から選ぶ方が効率がいい。特に、ファイルがそんなにお多くないbのに、わざわざコマンドを打つのが面倒
;; 日本語入力はローマ字を変換したい。日本語入力はつかいたくない。コマンドが打てない。
;; メソッドの予測変換時に括弧や引数の自動生成はしてくれないかなぁ。
;; cssの編集をしやすくする。scssとか、もっとやるなら、CoffeeScriptのなんかもいれると良いかもしれない。

;; twitterをやりたい。Tweetdecがすぐ落ちる。
;; ☆大文字のCがRails入力中に打てない。 今はsmart compileをコメントアウトして対応できるようにする。
;; ☆他のマシンでもすぐに展開できるようにする。bundle installのように、設定ファイルさえあれば、すぐに使えるようにしたい。
;; バイトコンパイルをemacs起動をしなくてもできるようにしたい。評価しちゃえば適用できるからこれは後でいい。
;; ☆elpa, melpa等でのダウンロードフォルダをelispフォルダに統一したい。設定はしたと思うが反映がされてないようだ。
;; ☆package-install時、リストが出てこないときがある。
;; ☆打ち間違いが多い。補完ができないと、デバッグだけで数時間かけることになり非常に無駄。
;; ☆elispのエラーメッセージをもっと工夫できないか？elispを自在にデバッグできるようにする。
;; コメントが読みづらい。やっぱり;が4つより、コメントを3行にして文字を;で囲むようにする方が見やすいよ
;; ☆elipsにもjumpが欲しい。
;; ☆rubyの開発環境を整える。
;; smooth-scrollの速度を上げる。








